{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_lora_weights": true,
  "lora_alpha": 256,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "peft_type": null,
  "r": 128,
  "revision": null,
  "sparse_preserve_mode": 2,
  "target_modules": [
    "q_proj"
  ],
  "task_type": null,
  "use_rslora": false
}